accscms-test/TempXML/CMS/vsed.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:man="http://accscms.tti.com/schemas/ManifestDefinition" xmlns:bas="http://accscms.tti.com/schemas/BaseDefinition" xmlns:man1="http://accscms.tti.com/schemas/Manifest">
   <soapenv:Header/>
   <soapenv:Body>
      <man:SetVesselScheduleRequest>
         <bas:messageContext>
            <bas:usernameToken>
               <bas:username>?</bas:username>
               <bas:passwordDigest>?</bas:passwordDigest>
               <bas:nonce>?</bas:nonce>
               <bas:created>?</bas:created>
            </bas:usernameToken>
            <!--Optional:-->
            <bas:offset>?</bas:offset>
            <!--Optional:-->
            <bas:numOfResult>?</bas:numOfResult>
         </bas:messageContext>
         <man:messageDetail>
            <man:vesselSchedule>
               <man1:vesselScheduleControl>
                  <man1:referenceNumber>?</man1:referenceNumber>
                  <man1:receivedControlNumber>?</man1:receivedControlNumber>
                  <man1:modeOfTransport>?</man1:modeOfTransport>
                  <man1:processingIndicator>?</man1:processingIndicator>
                  <man1:typeOfTransport>?</man1:typeOfTransport>
                  <man1:shipAgentTaxNumber>?</man1:shipAgentTaxNumber>
                  <man1:shipAgentBranch>?</man1:shipAgentBranch>
                  <man1:callsign>?</man1:callsign>
                  <man1:vesselName>?</man1:vesselName>
                  <man1:masterName>?</man1:masterName>
                  <man1:previousFlightNo>?</man1:previousFlightNo>
                  <man1:previousDate>?</man1:previousDate>
                  <man1:nationality>?</man1:nationality>
                  <man1:netRegisterTonnage>?</man1:netRegisterTonnage>
                  <man1:grossRegisterTonnage>?</man1:grossRegisterTonnage>
                  <man1:deadWeightTonnage>?</man1:deadWeightTonnage>
                  <man1:registrationID>?</man1:registrationID>
               </man1:vesselScheduleControl>
               <!--1 to 99999 repetitions:-->
               <man1:vesselScheduleDetail>
                  <man1:receivedControlNumber>?</man1:receivedControlNumber>
                  <man1:portOfDischarge>?</man1:portOfDischarge>
                  <man1:flightNo>?</man1:flightNo>
                  <man1:flightDate>?</man1:flightDate>
                  <man1:flightTime>?</man1:flightTime>
                  <man1:estimateToBerthDate>?</man1:estimateToBerthDate>
                  <man1:estimateToBerthTime>?</man1:estimateToBerthTime>
                  <man1:berth>?</man1:berth>
                  <man1:lastPortOfCall>?</man1:lastPortOfCall>
                  <man1:numberOfMasterAirWaybill>?</man1:numberOfMasterAirWaybill>
                  <man1:numberOfHouseAirWaybill>?</man1:numberOfHouseAirWaybill>
                  <man1:numberOfContainer>?</man1:numberOfContainer>
                  <man1:totalGrossWeight>?</man1:totalGrossWeight>
                  <man1:totalGrossWeightUnitCode>?</man1:totalGrossWeightUnitCode>
                  <man1:messageFunction>?</man1:messageFunction>
                  <man1:lastEntry>?</man1:lastEntry>
               </man1:vesselScheduleDetail>
            </man:vesselSchedule>
         </man:messageDetail>
      </man:SetVesselScheduleRequest>
   </soapenv:Body>
</soapenv:Envelope>